In [4]:
import json
import pandas as pd
import numpy as np
import pprint # view data in a structured manner using pretty print

In [5]:
df = pd.read_json('simple.json') # simple json with dict type structure defined in one list

In [6]:
df

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [7]:
df = pd.read_json('simple_records.json', lines=True) # in this file, each row is a json in itself

In [8]:
df

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [11]:
# working with the standard python library json to read nested jsons

with open('nested.json') as f:
    data = json.load(f)

In [12]:
data

[{'student_roll_no': 101,
  'details': {'name': 'Andew', 'age': 12, 'grade': 'A'}},
 {'student_roll_no': 102,
  'details': {'name': 'Bhuvan', 'age': 18, 'grade': 'B'}},
 {'student_roll_no': 103,
  'details': {'name': 'Clinton', 'age': 11, 'grade': 'A'}},
 {'student_roll_no': 104,
  'details': {'name': 'Drake', 'age': 12, 'grade': 'C'}},
 {'student_roll_no': 105,
  'details': {'name': 'Eisha', 'age': 13, 'grade': 'B'}},
 {'student_roll_no': 106,
  'details': {'name': 'Farhan', 'age': 22, 'grade': 'C'}},
 {'student_roll_no': 107,
  'details': {'name': 'Garima', 'age': 11, 'grade': 'A'}},
 {'student_roll_no': 108,
  'details': {'name': 'Himanshu', 'age': 19, 'grade': 'A'}},
 {'student_roll_no': 109,
  'details': {'name': 'Ishaan', 'age': 10, 'grade': 'D'}},
 {'student_roll_no': 110,
  'details': {'name': 'Jason', 'age': 9, 'grade': 'B'}}]